// This is a personal academic project. Dear PVS-Studio, please check it.
// PVS-Studio Static Code Analyzer for C, C++, C#, and Java: https://pvs-studio.com
//ВАРИАНТ № А17/Б10
//1. Дан целочисленный массив, состоящий из N элементов (N > 0), содержащий, по крайней мере, два нуля. Вычислить сумму чисел из данного набора, расположенных между этими двумя нулями. Если нули идут подряд, то вывести 0. Если в массиве имеется только одно значение 0, то вычислить сумму всех его элементов.
//2. Дан целочисленный массив, состоящий из N элементов (N > 0). Преобразовать массив, прибавив к четным числам первый элемент. Первый и последний элементы массива не изменять. Вывести новый полученный массив.
//3. Вводится строка, состоящая из слов (разделенных знаком равенства - '='), содержащая, по крайней мере, один символ '='. Длина строки может быть разной. Вывести подстроку, расположенную между вторым и третьим знаком '=' исходной строки. Если строка содержит менее 3-х символов '=', то вывести всю строку.
//4. Вводится строка, состоящая из слов, разделенных подчеркиваниями (одним или несколькими). Длина строки может быть разной. Найти и вывести длину самого большого слова и вывести это слово на экран.
//5. Вводится строка, состоящая из слов, разделенных подчеркиваниями (одним или несколькими). Длина строки может быть разной. Определить и вывести на экран слово/слова, которые содержат ровно три буквы 'x'.

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Pr04
{
    internal class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
