//ВАРИАНТ № А17/Б10
//1. Дано целое положительное трехзначное число N (N>0). Проверить истинность высказывания: «Данное число N читается одинаково слева направо и справа налево».
//2. Даны два целых положительных числа A и B (число A меньше числа B). Найти произведение всех четных чисел расположенных между этими числами A и B.
//3. В вещественном массиве известны данные о количестве осадков, выпавших за каждый день месяца N (N - любой месяц в году). Найти общее число осадков, выпавших по четным числам месяца. Предоставить возможность пользователю реализовать заполнение элементов массива случайными (рандомными) числами.
//4. Написать функцию double DegToRad(D) вещественного типа, находящую величину угла в радианах, если дана его величина D в градусах (D — вещественное число, 0 ≤ D ≤ 360). Воспользоваться следующим соотношением: 180° = pi радианов.В качестве значения PI использовать предопределенную константу из библиотеки языка программирования.
//5. Вводится строка, состоящая из слов, разделенных подчеркиваниями (одним или несколькими). Длина строки может быть разной. Определить и вывести количество слов в строке.

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Pr11
{
    internal class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
