// ВАРИАНТ № А17/Б10
// 1. Даны ненулевые числа x, y. Проверить истинность высказывания: «Точка с координатами(x, y) лежит в четвертой координатной четверти».
// 2. В вещественном массиве известны данные о количестве осадков, выпавших за каждый день месяца N (N - любой месяц в году). Найти общее число осадков, выпавших по нечетным числам этого месяца. Предоставить возможность пользователю реализовать заполнение элементов массива случайными (рандомными) числами.
// 3. Вводится строка. Длина строки может быть разной. Подсчитать количество содержащихся в ней строчных букв латинского алфавита.
// 4. Вводится строка, состоящая из слов, разделенных подчеркиваниями (одним или несколькими). Длина строки может быть разной. Подсчитать количество содержащихся в строке согласных букв.
// 5. Написать функцию int TimeToSec(H, M, S) целого типа, которая возвращает общее количество прошедших секунд исходя из 3-х своих аргументов (H - часы, M -минуты, S -секунды).
// 6. Написать функцию int SumRange(A, B) целого типа, находящую сумму всех целых чисел от A до B включительно (A и B — целые положительные). Если A > B, то функция должна возвращать число 0.

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Pr08
{
    internal class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
