// This is a personal academic project. Dear PVS-Studio, please check it.
// PVS-Studio Static Code Analyzer for C, C++, C#, and Java: https://pvs-studio.com
//ВАРИАНТ № А17/Б10
//1. Даны ненулевые числа x, y. Проверить истинность высказывания: «Точка с координатами (x, y) лежит в четвертой координатной четверти».
//2. Дан целочисленный массив, состоящий из N элементов (N > 0). Преобразовать массив, прибавив к четным числам первый элемент. Первый и последний элементы массива не изменять. Вывести новый полученный массив.
//3. Дан целочисленный массив, состоящий из N элементов (N > 0). Найти и вывести количество элементов, расположенных перед первым минимальным элементом.
//4. Вводится строка-предложение. Длина строки может быть разной. Подсчитать количество содержащихся в строке знаков препинания (точка, запятая, двоеточие, точка с запятой, восклицательный знак, вопросительный знак).
//5. Вводится строка, состоящая из слов разделенных точками. Длина строки может быть разной. Сформировать и вывести подстроку, расположенную между второй и пятой точками исходной строки. Если в строке менее пяти точек, то вывести всю исходную строку.

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Pr06
{
    internal class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
