// ВАРИАНТ № А17/Б10
// 1. Проверить истинность высказывания: "Сумма всех цифр данного положительного трехзначного числа является четным числом".
// 2. В вещественном массиве хранятся сведения о количестве осадков, выпавших за каждый день месяца N (в месяце должно быть 30 дней). Определить, сколько осадков выпадало в среднем за один день в первую, вторую и третью декады этого месяца (декада состоит из 10 дней). Предоставить возможность пользователю реализовать заполнение элементов массива случайными (рандомными) числами.
// 3. Написать функцию int Max3(A, B, C) целого типа, возвращающую одно максимальное значение из 3-х своих аргументов (параметры A, B, C - целые числа).
// 4. Вводится строка. Длина строки может быть разной. Подсчитать количество содержащихся в этой строке чисел (от 0 до 9). Вычислить и вывести сумму этих чисел.
// 5. Вводится строка, состоящая из слов, разделенных подчеркиваниями (одним или несколькими). Длина строки может быть разной. Подсчитать количество содержащихся в строке гласных букв.

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Pr09
{
    internal class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
