// ВАРИАНТ № А17/Б10
// 1. Дано четырехзначное целое ненулевое положительное число N (N>0). Проверить истинность высказывания: "Все цифры данного числа различны".
// 2.Ввести пять различных ненулевых целых чисел. Найти произведение трех наибольших чисел.
// 3. Дан целочисленный массив, состоящий из N элементов (N > 0). Если в наборе имеются отрицательные нечетные числа, то найти сумму всех положительных четных чисел, иначе вычислить сумму всех чисел, которые кратные числу 5.
// 4. Написать функцию double TriangleS(a) вещественного типа, вычисляющую по стороне a равностороннего треугольника его площадь S = a2·(3)0.5/4 (параметр a является вещественным). С помощью этой процедуры найти площади трех равносторонних треугольников с данными сторонами.
// 5. Вводится строка, состоящая из слов, разделенных подчеркиваниями (одним или несколькими). Длина строки может быть разной. Определить и вывести количество слов, у которых второй и последний символ одинаковые.

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Pr19
{
    internal class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
